[{"id":"6cfdc451-a7cc-4000-8e2c-1dc83646cf70","type":"Full Time","url":"https://jobs.github.com/positions/6cfdc451-a7cc-4000-8e2c-1dc83646cf70","created_at":"Mon Jul 06 17:04:40 UTC 2020","company":"FlatWorld.Co","company_url":"https://flatworld.co","location":"EU-TimeZones (GMT+3 to GMT-2)","title":"Backend Developer (Node) -- Fully Remote!","description":"\u003cp\u003eBackend Developer - (Javascript, Node, AWS, DBs) -- Fully Remote!!\nSalary range – $50,000 – $65,000 per year + equity\u003c/p\u003e\n\u003cp\u003eThis is an exciting opportunity for a backend developer who is highly proficient with Javascript and Node to join a successful growing fin-tech company backed by some of the best Silicon-Valley investors and be part of a fully distributed team spread across the EU.\u003c/p\u003e\n\u003cp\u003eDeel built the first payroll platform for remote teams that connects localized compliance and payments in one system of record and automates everything. Their goal is to offer every company that hires remote talents with a one-stop-shop that makes onboarding, global compliance, and payments a piece of cake. Talent is everywhere; opportunities should be too!!  (learn about our vision here and here).\u003c/p\u003e\n\u003cp\u003eWe like to surround ourselves with people who are warm and creative and that fit well in a startup culture — move quickly, enjoy building and iterating, and can reason and debate without animosity. We’re generating revenue and growing fast by forming small teams and scaling them. Our stack is AWS-Lambda-Node-PostgreSQL-React. For the Backend role, you need to be proficient in all of the Backend stack as well as have commercial experience with one additional server-side language/framework (C# / Java / Golang / Ruby / Python / PHP / …).\u003c/p\u003e\n\u003cp\u003eYou will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJoin a multi-functional distributed team that owns our products from top to bottom\u003c/li\u003e\n\u003cli\u003eBe part of the product discovery and product delivery cycles that build our system\u003c/li\u003e\n\u003cli\u003eDevelop new features, APIs, improvements, and fixes to handle our current and future scale\u003c/li\u003e\n\u003cli\u003eBuild a system that delights its users\u003c/li\u003e\n\u003cli\u003eMaintain high engineering and security standards, and continuously improve our codebases and processes\u003c/li\u003e\n\u003cli\u003eWork with engineers and non-engineers across the company to develop and iterate at scale\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou’d be a great fit if you ❤️\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGot 4+ years of experience in a Backend role\u003c/li\u003e\n\u003cli\u003eHave excellent Javascript knowledge with a good understanding of its under-the-hood mechanisms\u003c/li\u003e\n\u003cli\u003eGot commercial experience with Node.js and at least one additional server-side language such as Python, Ruby, Java, PHP, or .Net.\u003c/li\u003e\n\u003cli\u003eAre highly proficient with AWS services such as API gateway, S3, Lambda, Kinesis\u003c/li\u003e\n\u003cli\u003eExperienced with serverless application architecture on AWS\u003c/li\u003e\n\u003cli\u003eExperienced in working with relational based database technologies, mainly PostgreSQL and MySQL\u003c/li\u003e\n\u003cli\u003eHave the ability to be self-directed and be effective working independently, yet feel equally comfortable contributing in a team environment\u003c/li\u003e\n\u003cli\u003eEnjoy delivering high-quality high-performance code that gets deployed within a couple of days\u003c/li\u003e\n\u003cli\u003eEnergetic and startup culture fit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSee the full job description on our website...\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://flatworld.co/job/backend-developer-009/\"\u003ehttps://flatworld.co/job/backend-developer-009/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--27b3cbc62b69fe78c2d8a4cf1b52fb3cf9865e6b/deel_logo.png"},{"id":"585ed8c9-b612-4a52-a937-1f1e46fed3ac","type":"Full Time","url":"https://jobs.github.com/positions/585ed8c9-b612-4a52-a937-1f1e46fed3ac","created_at":"Fri Jul 03 08:02:12 UTC 2020","company":"Craft Courses Limited","company_url":null,"location":"Pembrokeshire","title":"Senior full stack Ruby engineer","description":"\u003cp\u003eSenior full stack Ruby engineer\n(£52-60k)\u003c/p\u003e\n\u003cp\u003eThe role\nWe are looking for an experienced Ruby developer to join the CraftCourses.com team full-time and take the lead in the development of the web site, mobile and internal systems. Our ecommerce system is in Ruby on Rails with MySQL and various payment and third-party integrations. We use Elastic search and AWS services. A working knowledge of PHP would come in handy too. We are a small close-knit team and we rely on each other to deliver excellence, whether that be in our approachable customer relations or on our web systems. We have a passion for doing some good in the world and this company delivers on that fully! The role is perfect for someone looking to make Pembrokeshire, with its beautiful coast and mountains, their home, though remote working is an option.\u003c/p\u003e\n\u003cp\u003eWhat we are looking for:\nWe're looking for someone to get up to speed with our codebase quickly, so that means we'll need you to have significant professional experience with Ruby and Ruby on Rails.\u003c/p\u003e\n\u003cp\u003eYou'll be responsible for the full software stack, so you'll need to demonstrate a working knowledge of modern JavaScript (we currently use VueJS). Stripe and ElasticSearch are core to our application. If you haven't used these particular tools, we'll want to know how your experience will transfer to them.\u003c/p\u003e\n\u003cp\u003eWe have some applications running Laravel on PHP that need to be maintained so experience of this is a plus, but an ability and willingness to become comfortable working on them is more important.\u003c/p\u003e\n\u003cp\u003eWe use Codeship CI to run our tests, and we're expecting the right candidate to be familiar with writing tests and running CI as part of their day-to-day work.\u003c/p\u003e\n\u003cp\u003eThe technologies we work with are:\nRuby on Rails 6\nAWS services including Elastic Beanstalk, Cloudfront, ELB and RDS\nPHP + Laravel 5.7\nVueJS\nCodeship CI\nElasticSearch\nStripe\nMailgun\nDelayed Job\nBeanstalkd\nMailChimp\u003c/p\u003e\n\u003cp\u003eAbout CraftCourses.com\nCraftCourses.com is a platform to help people experience the joy and satisfaction of making and doing.\nBased in Pembrokeshire, we are the UK’s largest creative experience site with online booking and gift vouchers. We have 1.5 million unique visitors per year (2019) and thousands of courses - yet each experience is a personal human connection. We are the opposite of mass market.\u003c/p\u003e\n\u003cp\u003eCompany culture\nOur company culture is all about providing excellent service to our makers, whether they be at the learning or teaching end. We are a force for good in the world, we want to help life become more creative, more satisfying and more meaningful.\u003c/p\u003e\n\u003cp\u003eWe are a small team of 8, so each of us must be multi-talented. This position is no different. Each of us must grow the business. Each of us will play a key role in changing the world around us.\u003c/p\u003e\n\u003cp\u003eThe ideal person for this role has:\nA solid track history of developing and maintaining smooth and attractive ecommerce sites\nA love of solving problems, coming up with creative solutions and a can-do approach\nExceptional work ethic; the ability to work alone and lead projects to completion\nA genuine interest in creativity and our company ethos (i.e. how making and doing is good for us as people).\u003c/p\u003e\n\u003cp\u003eEssential attributes:\nSolutions-based, clear mind, positive, hardworking, fun, efficient, compassionate, IDEAS!\u003c/p\u003e\n\u003cp\u003eBenefits:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork from home opportunities\u003c/li\u003e\n\u003cli\u003eOn-site parking\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eCompany pension\u003c/li\u003e\n\u003cli\u003eCasual dress\u003c/li\u003e\n\u003cli\u003eEmployee discounts\u003c/li\u003e\n\u003cli\u003eCompany events \u0026amp; social hours\u003c/li\u003e\n\u003cli\u003eBirthday off\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply with your CV and a covering email addressed to \u003ca href=\"mailto:kate@craftcourses.com\"\u003ekate@craftcourses.com\u003c/a\u003e explaining why you are right for this role. Please demonstrate past experience and a genuine interest in the field and ethos of our company as well as your ideas for how you would tackle this job, creatively as well as practically.\nBefore you apply for this job please familiarise yourself with the website.\nLooking forward to hearing from you!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckdGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--62a20596727293ad3f42ebd102aee5e5fa46a088/Craft%20Courses%20Icon%20Green.jpg"},{"id":"bfda54c4-da1a-4487-a579-637f9c7a0ffb","type":"Full Time","url":"https://jobs.github.com/positions/bfda54c4-da1a-4487-a579-637f9c7a0ffb","created_at":"Thu Jul 02 22:24:18 UTC 2020","company":"One More Cloud","company_url":"http://bonsai.io","location":"Remote","title":"Senior Platform Engineer","description":"\u003cp\u003eBonsai is hiring a Senior Platform Engineer to help build, scale and support the underlying technical platform that help us manage thousands of Elasticsearch clusters on AWS and GCP. This is a 100% remote full-time position. Salary ranges from $120 to $130k, based on experience.\u003c/p\u003e\n\u003ch2\u003eAbout the job\u003c/h2\u003e\n\u003cp\u003e“Hey, we’ve put your add-on in production. Good luck. Don’t crash.” —Heroku\u003c/p\u003e\n\u003cp\u003eThe essence of platform engineering at Bonsai will be to operate and support Elasticsearch at scale. The emphasis here is more on the scale part than the Elasticsearch part, but you’ll definitely become intimate with Elasticsearch and Lucene along the way.\u003c/p\u003e\n\u003cp\u003eThere are several key components involved. First we have Elasticsearch itself. Then a handful of proprietary plugins to enhance its functionality and support its operation. From there, the networking stack that handles connections and does diagnostic tracing. Telemetry and observability across the board. Finally our packaging and deployment, and internal services for fleet orchestration.\u003c/p\u003e\n\u003cp\u003eIf that sounds like more than one person’s job, we agree. Your future colleague Dan is going to be particularly stoked to work with you.\u003c/p\u003e\n\u003cp\u003eYou can think of this similar to a “SRE” position. When there’s an issue with performance or reliability, you’ll dig in and trace requests and analyze from load balancers down to memory managers, and help code and ship a patch to make it visible, and make it better.\u003c/p\u003e\n\u003cp\u003eThere’s a heavy dose of Java and Linux involved in all of this, but if you have some experience in systems programming in other languages, we can certainly teach all of that.\u003c/p\u003e\n\u003cp\u003eWe’re a small team, but we punch above our weight in systems engineering and operations. Launching at the right place and time dropped us into the deep end of early adopters, and we’ve been scaling ever since. Fortunately our early team was heavily engineering minded. Our original founder was previously a database engineer at Twitter when they went through their years of crazy scaling. We also hosted some massive sites like Pinterest whose 100x growth on our platform was a true trial by fire.\u003c/p\u003e\n\u003cp\u003eThis position does involve wearing the metaphorical pager in a rotation with other engineers on the team. We’re on call not because we expect to be woken up, but so we’re accountable to shipping systems that never need us to!\u003c/p\u003e\n\u003ch2\u003eSome example projects\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMoving decentralized server-initiated threshold alerts into a centralized time-series stream analysis service.\u003c/li\u003e\n\u003cli\u003eBuilding a continuous delivery service that performs gradual fleetwide rollouts of new and updated services, subject to canary stages and operational verification at certain checkpoints.\u003c/li\u003e\n\u003cli\u003eBuild and package new versions of Elasticsearch OSS, and update our suite of plugins to use the latest plugin interfaces, including customer-supplied proprietary plugins.\u003c/li\u003e\n\u003cli\u003eTroubleshoot a customer-supplied Elasticsearch plugin with a performance hot-spot, trace the problem to a likely location and provide support and guidance to improve efficiency.\u003c/li\u003e\n\u003cli\u003eDiagnose a server-side agent as having problematic memory usage, and port it from Ruby to Crystal to improve performance and resource usage.\u003c/li\u003e\n\u003cli\u003eCollaborate with Product engineers to build a data pipeline to support customer-facing metrics graphs.\u003c/li\u003e\n\u003cli\u003eAssist our customer support by triaging operational incidents and performing incident response.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThe ideal engineer\u003c/h2\u003e\n\u003cp\u003eWe’re looking for someone experienced, who’s ready to dive in. You don’t need to be an Elasticsearch expert — you’ll learn all of that on the job. We’ll have plenty of conversations about how Lucene is really a data structures library optimized for disk access.\u003c/p\u003e\n\u003cp\u003eExperience with Java is more helpful, although C, C++ and Golang would be a good starting points. We’ll also be looking for solid fundamentals in networking, disk access, memory management, and schedulers.\u003c/p\u003e\n\u003cp\u003eSeveral of our systems make heavy use of Netty, as does Elasticsearch itself. So familiarity with Netty or evented systems will be helpful.\u003c/p\u003e\n\u003ch2\u003eThe ideal teammate\u003c/h2\u003e\n\u003cp\u003eOne More Cloud (OMC) is small, remote-first, and team-conscious.\u003c/p\u003e\n\u003cp\u003eOMC has always been comprised of a small team. As such, each of our colleagues wears many hats. We lack middle managers and dedicated Project Managers that slice and dice out work; OMC managers are also contributors. They serve as a sounding board and for coaching higher level project and career questions. Everyone is expected to manage projects together. So, our team works best with individuals who take responsibility for their to-do lists, and those who enjoy working collaboratively with teammates to plan out projects and don’t shy away from offering their opinions.\u003c/p\u003e\n\u003cp\u003eOMC has been a remote-first company from day one, and we have a lot of experience in managing and communicating across multiple timezones. One of our key ways of getting focused work done is eliminating too many meetings and video calls by writing out our thought processes, documenting steps we take, and sharing it with the team. Our ideal teammate should be comfortable with and undaunted at writing clear and logical longer-form English prose on a regular cadence.\u003c/p\u003e\n\u003cp\u003eWe are team-conscious. Yes, we have a company hierarchy based on skills and the level of risk a position incurs (like responsibility for servers that have big costs attached to them). However, the onus is on every individual at OMC(regardless of hierarchy) to create a culture that allows a space for creativity, honesty, and autonomy for everyone who joins OMC. We don’t look for team heroes or martyrs but rather strive to create healthy and realistic team responsibility. We collaborate best with those who are considerate of their teammates, respect boundaries, and are dedicated to pursuing our work with curiosity, respect, and optimism.\u003c/p\u003e\n\u003ch2\u003eAbout One More Cloud\u003c/h2\u003e\n\u003cp\u003eOMC provides specialized hosted cloud services through two SAAS services: Websolr (websolr.com) and Bonsai (bonsai.io). We launched Websolr in 2009 as the first cloud hosted Solr as a service, and one of the very first batch of Heroku addons. Bonsai followed in 2012 as the first hosted Elasticsearch as a service on the market.\u003c/p\u003e\n\u003cp\u003eOur company is small, profitable, and independent. Our entire team, starting with the founders, is comprised of developers, engineers, scientists, and designers with a passion for providing useful tools and services for developers and businesses. As truth-seeking creatives and thinkers, we strive for excellence from design to execution.\u003c/p\u003e\n\u003cp\u003eWe manage the search engines for ecommerce applications, social media sites, magazine archives, classifieds search, job boards and resume search, CRMs, content management systems, and more. We've been fortunate to serve teams at startups and established sites alike, such as Airbrake, Best Buy, Bullhorn, Couchsurfing, Ello, Fairfax Media, GitHub, Heroku, Muck Rack, OfferUp, Pinterest, Scripted, wikiHow, and more.\u003c/p\u003e\n\u003cp\u003eBenefits for working at OMC include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical and Dental Insurance\u003c/li\u003e\n\u003cli\u003e40 hour work week. We practice healthy work and life boundaries.\u003c/li\u003e\n\u003cli\u003eWork where you want. We're a remote-first company, and have been from day one since 2009.\u003c/li\u003e\n\u003cli\u003e401k, with company contributions\u003c/li\u003e\n\u003cli\u003eWellness allowances\u003c/li\u003e\n\u003cli\u003eAnnual continuing education allowance\u003c/li\u003e\n\u003cli\u003ePaid parental leave\u003c/li\u003e\n\u003c/ul\u003e\nLearn More\n\u003cp\u003eView our careers page at \u003ca href=\"bonsai.io/careers\"\u003ebonsai.io/careers\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eView our current team and company story at \u003ca href=\"bonsai.io/about\"\u003ebonsai.io/about\u003c/a\u003e and \u003ca href=\"omc.io\"\u003eomc.io\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eView the products you'll work on to support at \u003ca href=\"bonsai.io\"\u003ebonsai.io\u003c/a\u003e and \u003ca href=\"websolr.com\"\u003ewebsolr.com\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply through our Greenhouse posting: \u003ca href=\"https://boards.greenhouse.io/onemorecloudinc/jobs/4433722002?gh_source=github\"\u003ehttps://boards.greenhouse.io/onemorecloudinc/jobs/4433722002?gh_source=github\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80f5744a2b137d6f09e6234058c4d55f02b86371/cloud-plus-blue-bg.png"},{"id":"911a5212-129b-491f-95d4-f7eaa19bdefa","type":"Full Time","url":"https://jobs.github.com/positions/911a5212-129b-491f-95d4-f7eaa19bdefa","created_at":"Thu Jul 02 17:01:53 UTC 2020","company":"Zappos.com","company_url":"http://jobs.zappos.com","location":"USA Remote","title":"Senior Software Engineer- Full Stack","description":"\u003cp\u003eWork remotely temporarily due to COVID-19\u003c/p\u003e\n\u003cp\u003eWe are a small team helping groups throughout the organization solve problems and develop new ideas. Our projects focus on the future of Zappos by building interactive experiences centered around customer service. We are a nimble team that moves fast and empowers others to build and experiment with new Zappos experiences rapidly.\u003c/p\u003e\n\u003cp\u003eWe are looking for candidates who have a sense of ownership to deliver quick but extensible solutions. You will have the freedom to incubate new ideas with the backing of a large yet passionate-about-culture organization. Our current platform is built on Ruby on Rails and React.js, but we will always prioritize finding the right tool for the job.\u003c/p\u003e\n\u003cp\u003eSome of our recent projects include launching ZapposKids.com (\u003ca href=\"https://www.zappos.com/e/shops/kids\"\u003ehttps://www.zappos.com/e/shops/kids\u003c/a\u003e) and Zappos Goods for Good (\u003ca href=\"https://www.zappos.com/e/goods-for-good\"\u003ehttps://www.zappos.com/e/goods-for-good\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWhat you'll be doing:\u003c/p\u003e\n\u003cp\u003eResponsibilities range from team \"ideation\" to hands-on implementation, testing, and debugging of projects at different levels of the stack as needed. Typical projects involve a responsively-designed front end, a Rails-based server application, and possibly some form of asynchronous back-end processing. You must be willing and able (and excited) to accept responsibility for enhancing required skills and completing assigned tasks over the course of changing projects and initiatives. Adapt and thrive!\u003c/p\u003e\n\u003cp\u003eWhat you'll bring to the table:\u003c/p\u003e\n\u003cp\u003eWe are ideally looking for \"T-shaped developers\"—people who have a broad interest and understanding of technology and the web, but also have deep interest in a specialized area. We want someone who fits most (or ALL!) of these bullet points:\u003c/p\u003e\n\u003cp\u003e5-7+ years production software development experience\nA solid knowledge of many (not necessarily all) of these technologies: React, HTML5, CSS3, Ruby/Ruby on Rails, and relational databases.\nStrong frontend development skills\nExperience with modern front end JavaScript frameworks (React, Angular, Vue, etc.)\nExperience with unit/integration testing\nDevOps experience is a plus (especially with AWS and automated deployments)​.\nA solid, demonstrable grasp of good web, object-oriented, and asynchronous programming concepts.\nThe drive and open-mind to learn and adopt new skills continually.\nSide projects and ideas for side projects you haven't started yet would be great.\nAn open-mind and personable disposition. You like to collaborate and can give and take constructive criticism cheerfully.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease click the link to apply!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://app.jobvite.com/j?cj=ohGO9fwE\u0026amp;s=Githubjobcw\"\u003ehttps://app.jobvite.com/j?cj=ohGO9fwE\u0026amp;s=Githubjobcw\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcW1GIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf9ec8463681dc3fc05b016bf6334be04f4cfbc0/zappos%20logo.png"},{"id":"94df0e7f-ecdb-489d-b9a5-dda1b121816c","type":"Full Time","url":"https://jobs.github.com/positions/94df0e7f-ecdb-489d-b9a5-dda1b121816c","created_at":"Tue Jun 30 14:59:42 UTC 2020","company":"HubTran","company_url":"https://www.hubtran.com","location":"USA Remote","title":"Senior Software Engineer Rails/Elm/JS","description":"\u003cp\u003eAre you the kind of person who likes working on a variety of challenging projects? Would you enjoy helping a team work on automation improvements this month and then move to tuning our OCR process next month? Do you want to lead development of new strategic features? If so, being a HubTran Senior Software Engineer might be the thing for you. We are looking for one or more people to help us solve our most challenging issues.\u003c/p\u003e\n\u003cp\u003eAt Hubtran, you will join a team that:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHas experience. The majority of our developers have more than 10 years of professional experience. * One has published a book with the Pragmatic Programmers.\u003c/li\u003e\n\u003cli\u003eHas won the Chicago Innovation Award and Harvard Business School New Venture Contest.\u003c/li\u003e\n\u003cli\u003eIs fully remote. We care about what you can accomplish, not where you choose to accomplish it from.\u003c/li\u003e\n\u003cli\u003eBelieves diversity is essential and strongly encourages applications from women and minority candidates.\u003c/li\u003e\n\u003cli\u003eCan articulate their values. You can read about our values at on our \u003ca href=\"https://www.hubtran.com/marketing/welcome-to-the-new-hubtran-blog/\"\u003eblog\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003ePays well.\u003c/li\u003e\n\u003cli\u003eOffers benefits including health insurance, 4 weeks of vacation, 401k, and more.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur code is a mixture of Ruby, Elm and JavaScript. Additionally, we have a strong interest in functional programming languages like Haskell, OCaml, Elixir, and Idris. We're also using Rails, React, Postgresql, Redis, Docker, and more. While these are the tools we're currently using, you don't need to have previous experience with all of them. We know that good developers are capable of quickly picking up new languages and tools.\u003c/p\u003e\n\u003cp\u003eIn order to succeed in this role you should be:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced. You have designed and implemented entire projects not just individual stories.\u003c/li\u003e\n\u003cli\u003eCurious. You aren't content with the status quo and know that we can always improve.\u003c/li\u003e\n\u003cli\u003eSelf-directed. You can work on your own while prioritizing tasks.\u003c/li\u003e\n\u003cli\u003eCollaborative. You can work with others to improve a solution.\u003c/li\u003e\n\u003cli\u003eEmpathetic. Your designs are influenced by a deep understanding of the customers' needs.\u003c/li\u003e\n\u003cli\u003eA strong communicator. You will proactively communicate issues and trade-offs with team members to support alignment and fast decision making.\u003c/li\u003e\n\u003cli\u003eBe an outstanding developer. Your peers should recognize you as one of the best and the brightest developers they have worked with.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLeading an engineering team or running a consulting company.\u003c/li\u003e\n\u003cli\u003eExperience or strong interest in Machine Learning.\u003c/li\u003e\n\u003cli\u003eExperience with functional languages like Elm, Haskell, OCaml, or Elixir.\u003c/li\u003e\n\u003cli\u003ePrevious Logistics experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://www.hubtran.com\"\u003eHubTran\u003c/a\u003e is a fast-growing technology startup focused on automating work in the logistics industry. Through a combination of a powerful browser based interface and machine learning, we are able to reduce our customer's workload by 4x or more. HubTran is well funded with significant upside potential.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://apply.workable.com/hubtran/j/99980907C2/apply/\"\u003ehttps://apply.workable.com/hubtran/j/99980907C2/apply/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a71072224f97f1f53c6a38d6a7c0cc3c3fbda394/hubtran-color-logo-new.png"},{"id":"75180814-9cb0-4326-b388-9ff7ae267426","type":"Full Time","url":"https://jobs.github.com/positions/75180814-9cb0-4326-b388-9ff7ae267426","created_at":"Fri Jun 19 16:25:19 UTC 2020","company":"Anedot","company_url":"https://anedot.com","location":"Remote (LA, CA, WA, TX, MD, OH)","title":"Senior Frontend Programmer","description":"\u003cp\u003eYou enjoy programming for complex data platforms with transactional workflows and zero tolerance for errors. We believe that happy people produce better results for themselves and the collective team. We believe and value empowering people to work on something they enjoy — thus applicants likely would want to have an interest in serving campaigns, churches, ministries, non-profits, and schools.\u003c/p\u003e\n\u003ch3\u003e5 Tasks \u0026amp; responsibilities\u003c/h3\u003e\n\u003col\u003e\n\u003cli\u003eWrite well-designed, testable code, commit work to GitHub and write tests for existing and created code to ensure compatibility and stability.\u003c/li\u003e\n\u003cli\u003eWork in friendly agile team, collaborative, engineering environment with continuous delivery.\u003c/li\u003e\n\u003cli\u003eReview the work of other engineers providing feedback and suggestions for improvement.\u003c/li\u003e\n\u003cli\u003eWork with the team to upgrade, troubleshoot, and debug, existing systems.\u003c/li\u003e\n\u003cli\u003eContinuously increase knowledge and skills (including relevant codebase languages, frameworks, \u0026amp; tools).\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3\u003e4 Skills \u0026amp; experience the candidate must have\u003c/h3\u003e\n\u003col\u003e\n\u003cli\u003eFull-stack programming experience on a platform serving at least thousands of users (Strongly prefer with strong React knowledge and basic Ruby/Rails).\u003c/li\u003e\n\u003cli\u003eMinimum 5 years working in an agile team-oriented development environment with peer code reviews.\u003c/li\u003e\n\u003cli\u003eStrong familiarity with React.\u003c/li\u003e\n\u003cli\u003eBachelor’s degree (computer science, math, or related field a plus).\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3\u003eWays the candidate will be evaluated\u003c/h3\u003e\n\u003col\u003e\n\u003cli\u003eApp performance\u003c/li\u003e\n\u003cli\u003eCode contribution and quality (Git metrics)\u003c/li\u003e\n\u003cli\u003eCommunication, teamwork, documentation, and completeness of work; aka \"responsible and cool to work with\" (peer review)\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3\u003eCompensation\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eBased on experience\u003c/li\u003e\n\u003cli\u003ePTO Minimum 18-days per year\u003c/li\u003e\n\u003cli\u003eRemote work from CA, FL, LA, MD, OH, TX, or WA\u003c/li\u003e\n\u003cli\u003eTemporarily paused: Fitness Allowance, Wellness Allowance, Home-office Allowance, and CSA Allowance\u003c/li\u003e\n\u003cli\u003e401k plan available\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eTeam\u003c/h3\u003e\n\u003cp\u003eProgrammers work on our Product team as part of the Engineering team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOperations (Accounts, Finance, Service)\u003c/li\u003e\n\u003cli\u003eProduct (Design, DevOps, Engineering)\u003c/li\u003e\n\u003cli\u003eGrowth (Marketing, Outreach, Success)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eCompany Values\u003c/h3\u003e\n\u003cp\u003eWe're rooted in Southern Louisiana but operate as a remote-first company that supports our team living in Texas, California, Washington, Ohio, Maryland, and Florida. We've got an old fashioned commitment to honor and excellence in what we do, and our customer-first hospitality is described as welcoming, courteous, helpful, respectful, and kind. We're the type of people whom you count on to do what is right and have your back.\u003c/p\u003e\n\u003ch3\u003eTechnical Info\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eJavascript (React)\u003c/li\u003e\n\u003cli\u003eRuby (Rails)\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eGitHub\u003c/li\u003e\n\u003cli\u003eAWS Cloud platform\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eSidekiq Enterprise for workers/jobs/queues\u003c/li\u003e\n\u003cli\u003eTesting tools/frameworks\u003c/li\u003e\n\u003cli\u003eTravisCI\u003c/li\u003e\n\u003cli\u003eJest\u003c/li\u003e\n\u003cli\u003eCypress\u003c/li\u003e\n\u003cli\u003eGitHub Actions\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eApplication Process\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eSubmit Team Member Application (\u003ca href=\"https://anedot.com/careers\"\u003ehttps://anedot.com/careers\u003c/a\u003e)\u003c/li\u003e\n\u003cli\u003eFit Assessment\u003c/li\u003e\n\u003cli\u003eTechnical Assessment\u003c/li\u003e\n\u003cli\u003eTeam Specific Interview\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cul\u003e\n\u003cli\u003eSubmit Team Member Application (\u003ca href=\"https://anedot.com/careers\"\u003ehttps://anedot.com/careers\u003c/a\u003e)\u003c/li\u003e\n\u003cli\u003eFit Assessment\u003c/li\u003e\n\u003cli\u003eTechnical Assessment\u003c/li\u003e\n\u003cli\u003eTeam Specific Interview\u003c/li\u003e\n\u003c/ul\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanVGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8863996d3a2db0cec0c55b5806664e4ac7b1207e/Anedot--Blue.png"},{"id":"1a1d60b4-8f36-42f8-824f-f6bb1419e7e6","type":"Full Time","url":"https://jobs.github.com/positions/1a1d60b4-8f36-42f8-824f-f6bb1419e7e6","created_at":"Thu Jun 11 19:38:37 UTC 2020","company":"Arcadia","company_url":"https://www.arcadia.com","location":"Washington DC/Remote ","title":"Senior DevOps Engineer","description":"\u003cp\u003eArcadia is a technology company revolutionizing the energy industry. We make choosing clean energy easy for everyone, no matter where you live or who your utility provider is. Founded in 2015, Arcadia set out with one purpose that continues to drive us today: \u003cstrong\u003ea 100% clean energy future.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTackling one of the world’s biggest challenges – climate change – requires out-of-the-box thinking and diverse perspectives, so we’re building a team of individuals from all different backgrounds, industries, and educational experiences. If you share our passion for building a future powered by 100% renewable energy, we look forward to receiving your application and learning what you would uniquely bring to our organization!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we’re looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are seeking an experienced candidate with a background building scalable web infrastructure to join the Systems Engineering team as a Senior DevOps Engineer. The ideal candidate has prior experience tackling scalability challenges at tech startups undergoing rapid platform adoption \u0026amp; growth, strongly believes in infrastructure as code, and relishes the chance to take on a highly visible role within a collaborative engineering team. This is a rare opportunity to solve new \u0026amp; complex problems related to applications and engage with both cutting-edge and tried-and-true cloud technologies while helping expand renewable energy access to millions of households across the country!\u003c/p\u003e\n\u003cp\u003eThis role is based in Washington, D.C. with the potential to work remotely and reports to the Engineering Manager on the Systems team. Our core stack includes several Ruby on Rails apps, a GraphQL service layer, and a number of React clients. We also have a data pipeline that relies heavily on AWS Lambdas running Python. Our infrastructure is primarily AWS-based, using Cloudformation. In your application, please include a link to GitHub or another place where your code is published, though we understand that not everyone has public code online.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHelp evolve and maintain our application infrastructure\u003c/li\u003e\n\u003cli\u003eCollaborate with the rest of the engineering team, as well as the analytics \u0026amp; data science team, to spec, build, test, and deploy new features and functionality\u003c/li\u003e\n\u003cli\u003eMentor and guide teammates, empowering them to make good design decisions\u003c/li\u003e\n\u003cli\u003eAuthor and maintain business-critical infrastructure-as-code\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will help you succeed:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMust-haves:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years (5-8 preferred) of experience in a startup environment as a Site Reliability, DevOps, or Systems Engineer supporting high-availability, large-scale web-based applications\u003c/li\u003e\n\u003cli\u003eExperience with Cloudformation or similar (Terraform, Ansible, etc.)\u003c/li\u003e\n\u003cli\u003eExperience managing and maintaining a resilient, fault-tolerant services-based cloud infrastructure (ideally on AWS)\u003c/li\u003e\n\u003cli\u003eStrong communication skills and the ability to translate complex technical concepts into clear, actionable information for product managers, analysts, and/or other engineers\u003c/li\u003e\n\u003cli\u003eMentorship/coaching skills; demonstrated ability to provide constructive feedback in code and design reviews\u003c/li\u003e\n\u003cli\u003eAbility to scope, prioritize, and deliver on project commitments\u003c/li\u003e\n\u003cli\u003eLove of mentoring \u0026amp; modeling behaviors for writing tests, code review, design documentation, debugging, and troubleshooting\u003c/li\u003e\n\u003cli\u003eInsatiable curiosity about how things work\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice-to-haves:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience working with data warehouses (Redshift, BigQuery, etc.)\u003c/li\u003e\n\u003cli\u003eExperience with PostgreSQL\u003c/li\u003e\n\u003cli\u003eExperience with Ruby and Rails\u003c/li\u003e\n\u003cli\u003eExperience with AWS Lambda\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarket-based compensation (salary + equity)\u003c/li\u003e\n\u003cli\u003eHealthcare, dental, vision, 401(k) and commuter benefits\u003c/li\u003e\n\u003cli\u003ePaid Time Off (holidays, vacation, professional development, volunteer, parental leave\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.arcadia.com/assets/Engineering_Strategy_and_Values_V4.pdf\"\u003eA supportive engineering culture that values diversity, empathy, teamwork, trust, \u0026amp; efficiency\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eProfessional development opportunities\u003c/li\u003e\n\u003cli\u003eAll-company lunches\u003c/li\u003e\n\u003cli\u003eFree clean energy\u003c/li\u003e\n\u003cli\u003eA chance to decarbonize and disrupt the energy sector\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEliminating carbon footprints, eliminating carbon copies.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere at Arcadia, we cultivate diversity, celebrate individuality, and believe unique perspectives are key to our collective success in creating a clean energy future. Arcadia is committed to equal employment opportunity regardless of race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, protected veteran status, or any status protected by applicable federal, state, or local law. While we are currently unable to consider candidates who will require visa sponsorship, we welcome applications from all qualified candidates eligible to work in the United States.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/bc1cfbf12us\"\u003ehttps://grnh.se/bc1cfbf12us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU9FIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ef77b092e81690eb09574fe0afe0af6b81ec8cc/arcadia-vertical-lockup-cmyk-color.jpg"},{"id":"364caf3c-700f-493f-a5bd-721062c77394","type":"Full Time","url":"https://jobs.github.com/positions/364caf3c-700f-493f-a5bd-721062c77394","created_at":"Wed Jun 10 15:04:49 UTC 2020","company":"Currencycloud","company_url":"https://www.currencycloud.com","location":"London","title":"Senior Scala Engineer","description":"\u003cp\u003e\u003cstrong\u003eSenior Scala Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReady to shape tomorrow?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is somewhere where innovative thinking and the power of technology know no limits. We know that the success of the business depends on the people who keep it moving, which is why we are looking for exceptional talent to join our international payments revolution.\u003c/p\u003e\n\u003cp\u003eWe’re bringing simplicity, transparency \u0026amp; scale to cross-border payments - a $120 trillion market.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur software engineers are responsible for implementing an industry-leading API that has already processed over $50 billion of cross-border transactions for over 5 million end users, and is available to our clients 24/7. But we’re not stopping there, and our engineers are at the forefront of taking us forward to meet the demands of even greater scale.\u003c/p\u003e\n\u003cp\u003eFrom our monolithic datacenter beginnings we’ve moved wholesale to AWS where our system runs as a set of distributed applications. We’re currently in the process of migrating those applications over to Kubernetes and Jenkins-X as we further embrace a microservices architecture.\u003c/p\u003e\n\u003cp\u003eAs a Senior Software Engineer you’ll play a key role within your team; taking responsibility for your services and the technology within them, but also in helping develop your team and its relationship with your product owner and the broader business. Teams are aligned to services and you’ll have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eclear ownership of your domain\u003c/li\u003e\n\u003cli\u003ea clean modern codebase\u003c/li\u003e\n\u003cli\u003ean independent path to production\u003c/li\u003e\n\u003cli\u003estrong platform and product support\u003c/li\u003e\n\u003cli\u003ethe ability to make real changes with real business value.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur microservices architecture enables us to explore new languages and technologies in parallel with our existing system. The core of our system has been built using Ruby, leveraging backing services like RabbitMQ, Redis, and MySQL/Aurora, but we are keen to bring in engineers with more diverse backgrounds, and help us take Currencycloud to the next level of scale.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will be joining the Payments team at CurrencyCloud, where we are creating software to trade currencies that unlocks unique capabilities previously not available to our customers. The nature of the always moving markets requires creating highly-scalable distributed systems.\u003c/p\u003e\n\u003cp\u003eWe are looking for a person who wants to build new software in Scala, and is comfortable with reading other languages – ideally Ruby as a significant part of the backend software in the company is written in Ruby. We use various technologies for handling our data, primarily: RabbitMQ, Redis and MySQL.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Details\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDay-to-day you’ll work with a variety of tools, technologies, capabilities and processes.\u003c/li\u003e\n\u003cli\u003eDistributed systems help to achieve scalability, improve availability and run our software in  cloud-native environments on Kubernetes.\u003c/li\u003e\n\u003cli\u003eCloud-related tools and services support these applications, such as Docker, Kubernetes, - ElasticSearch, log management systems, and Datadog APM, to name but a few.\u003c/li\u003e\n\u003cli\u003eAPI specifications, conforming to the OpenAPI (Swagger) standard, provide a clean boundary both externally between our customers and our product, and internally between our microservices.\u003c/li\u003e\n\u003cli\u003eProgramming languages, you should be comfortable with functional programming in Scala and have experience working with other programming paradigms.  There is also some Ruby, Java \u0026amp; Elixir in our code base.  Other important stack related tools are cats/cats-effect, doobie, http4s, circe, ZIO \u0026amp; Tagless final.\u003c/li\u003e\n\u003cli\u003eSQL, and large SQL databases, provide the persistence layer for our applications. You’ll be working with (and know the limitations of using) such large datastores.\nInfrastructure automation is primarily owned by the infrastructure team, but you will be a consumer of their work, familiarity with AWS, Terraform, Kubernetes (K8s) and Docker is beneficial.\u003c/li\u003e\n\u003cli\u003eTesting approaches, including TDD, BDD and Contract Testing, all form an important part of our approach to quality assurance; ensuring that the code that we write forms products that are fit for use. Our QA engineers use Cucumber.\u003c/li\u003e\n\u003cli\u003eAgile development, with teams broadly aligned with the Spotify - Squads \u0026amp; Tribes - model, helps us deliver incremental improvements to our products in an iterative manner. Advocating this model, and joining us on a journey of continuous improvement, is a key attribute of senior members of our teams.\u003c/li\u003e\n\u003cli\u003eContinuous Integration and Continuous Delivery pipelines allow us to “automate all the things”, providing repeatable builds and consistent deployments.\u003c/li\u003e\n\u003cli\u003eGitHub, and the GitHub PR review process, forms a core part of our developer workflow, and peer reviews help share knowledge and improve quality.\u003c/li\u003e\n\u003cli\u003eTeamwork, and cross-team collaboration, is fundamental to the delivery of our applications. Whilst each application has an independent path to production, there will always be some activities and initiatives that span multiple teams and require cross-team collaboration. Within your team you’ll need to collaborate with a number of stakeholders, including Product Owners and QA, as part of your product development.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNone of these on their own are a must-have to apply for the role, but it would be useful to share with us any knowledge or experience that you have in these areas.\u003c/p\u003e\n\u003cp\u003eI’m intrigued…what’s the interview process?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eQuick chat with our internal tech recruiter (to make sure things like salary, location, general approaches to dev are aligned to how we work.)\u003c/li\u003e\n\u003cli\u003eTech chat over a hangout with a Tech Lead or Senior Engineer (we want to have open discussions with you about how you approach coding and what you like from a team that you work with)\u003c/li\u003e\n\u003cli\u003eNormally we’d invite you to the office, but in Covid-19 times it will be all over video! We’ll talk about your experience, some coding approaches and you’ll also get a chance to talk with one of our - - Product Managers about how we all work together\u003c/li\u003e\n\u003cli\u003eChat with our engineering manager\u003c/li\u003e\n\u003cli\u003eWe’ll make you an offer\u003c/li\u003e\n\u003cli\u003eWe’re colleagues!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAnything extra to add?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA comfortable no dress code policy \u0026amp; flexible work from home arrangements are provided for all our employees.\u003c/p\u003e\n\u003cp\u003eWe offer a comprehensive range of employee benefits which include 25 days paid leave, 5% pension, BUPA health insurance, life insurance, long term sickness protection, a day off for your birthday and socials every Friday.\u003c/p\u003e\n\u003cp\u003eSo, if you’re ready to join a thriving global business in the heart of London, get in touch for an informal discussion!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:adam.bolton@currencycloud.com\"\u003eadam.bolton@currencycloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHlFIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--776863a0bb0a0aac36aa71a9085baabe2c53c75f/CC%20Logo%20Main_099.png"},{"id":"84af77eb-80ac-4517-a713-6bd940d97173","type":"Full Time","url":"https://jobs.github.com/positions/84af77eb-80ac-4517-a713-6bd940d97173","created_at":"Thu Jun 11 11:50:36 UTC 2020","company":"BackHub","company_url":"https://backhub.co/","location":"Remote","title":"Seeking Software Engineering Talent for SaaS Product","description":"\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://backhub.co/\"\u003eBackhub\u003c/a\u003e is a cloud to cloud backup solution for your GitHub repositories. Backups include metadata, such as issues, and come with daily snapshots up to 30 days back in time. Restore back to GitHub or clone directly from BackHub.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a team of SaaS enthusiasts based out of Germany and with BackHub we are on a mission to protect our customer's cloud data against data loss.\u003c/p\u003e\n\u003cp\u003eAt BackHub, we're working role-based and coordinate in circles. That means you can freely take on roles and join circles that spike your interest or leave them as you want to take on new endeavors.\u003c/p\u003e\n\u003cp\u003eTherefore, you won't find a static job description here. We hire people with a t-shaped personality who can thrive in a self-organizing environment.\u003c/p\u003e\n\u003cp\u003eSounds exciting? If you love what we do and see yourself fit into the culture, \u003ca href=\"https://calendly.com/backhub/get-to-know-call\"\u003elet's talk\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003eHere are some of the roles and topics for which we need help:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCloud- and Software Architecture\u003c/li\u003e\n\u003cli\u003eApplication Development (Ruby)\u003c/li\u003e\n\u003cli\u003eLinux- and Cloud (AWS) Operations\u003c/li\u003e\n\u003cli\u003eCI/CD\u003c/li\u003e\n\u003cli\u003eMonitoring\u003c/li\u003e\n\u003cli\u003ePerformance\u003c/li\u003e\n\u003cli\u003eFrontend Development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf any of these get you excited, \u003ca href=\"https://calendly.com/backhub/get-to-know-call\"\u003eschedule a 15 min call\u003c/a\u003e with us. It's a short, informal get to know call. If we both feel like it's a good fit, we will schedule a longer follow up call.\u003c/p\u003e\n\u003cp\u003ePlease note that we can only hire people with a residency in the European Union. Our ideal workweek has a maximum of 32 hours.\u003c/p\u003e\n\u003cp\u003eNo requests from recruiters please.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://calendly.com/backhub/get-to-know-call\"\u003eSchedule a 15 min call\u003c/a\u003e with us. It's a short, informal get to know call. If we both feel like it's a good fit, we will schedule a longer follow up call.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDZFIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--db0ec88b2dd15b3a9a0709bcffa140a8485746e2/Logo.png"},{"id":"b0248344-89e5-11e8-87e5-7d6aa5fe3ed0","type":"Full Time","url":"https://jobs.github.com/positions/b0248344-89e5-11e8-87e5-7d6aa5fe3ed0","created_at":"Fri Nov 16 16:34:22 UTC 2018","company":"SunteckTTS","company_url":null,"location":"Jacksonville, FL (Or Remote)","title":"Sr PHP Developer (Full-stack)","description":"\u003cp\u003eRequirements:\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eNice to Haves:\u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003eAbout the Role: \u003c/p\u003e\n\u003cp\u003eYou will be responsible for contributing to the technical design, development, and implementation of the SunteckTTS application ecosystem. The role involves more than just writing production code; in a typical week, you could be: brainstorming technical architecture options, providing feedback to improve our development processes, reviewing PRs from other team members, fixing a bug you randomly came across, or improving unit test coverage.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an outstanding Senior Developer with a desire to participate in a growing team with the skills, experience, and understanding to join a small, but strong development team. In order to meet the many challenges and high volume work of the SunteckTTS users, it is important for the Senior Developer to have excellent communication.\u003c/p\u003e\n\u003cp\u003eAbout SunteckTTS and the Team:\u003c/p\u003e\n\u003cp\u003eSunteckTTS is an industry-leading, full-service, transportation logistics provider that operates through a network of sales, operations, and capacity specialists. We are a billion dollar company with over 200 independently owned and operated agent offices across the U.S. and Canada.\nWe focus on providing asset and non-asset surface transportation to a wide range of end-use markets, including food, lumber, paper, printing, textiles, electronics, machinery, government, and more. The Application Development Group is in the midst of an ambitious program to create best in breed software products and improve existing systems for our user base. Our team of Business Analysts and Developers share a culture of self-ownership and open communication to provide\nmaximum business value. We strive to ensure team-based component ownership, development, and quality assurance. We are a tight knit group that relies on ability and flexibility to ensure we balance our strides towards improved process and need to meet the priorities of a heavily used\nenterprise system. The Application Development Group focuses on a culture of open communication, learning, and transparency.\u003c/p\u003e\n\u003cp\u003eSunteckTTS is an Equal Opportunity Employer and does not discriminate against qualified applicants with regard to race, color, religion, age, sex, national origin, handicap, sexual orientation or veteran status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to:\n\u003ca href=\"mailto:anthony.vargas@suntecktts.com\"\u003eanthony.vargas@suntecktts.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0538ec284289af7dbfceb09ccf27499bfa17aed3/823b3a50-63ca-4309-85b4-9ab437ebd949"},{"id":"2744c836-e97b-11e8-8236-5be6ba23f176","type":"Full Time","url":"https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176","created_at":"Fri Nov 16 08:41:52 UTC 2018","company":"Piktochart Sdn Bhd","company_url":null,"location":"Europe","title":"DevOps (Remote - Europe)","description":"\u003cp\u003eDear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!\u003c/p\u003e\n\u003cp\u003eYour mission:\u003c/p\u003e\n\u003cp\u003eDesign scalable and secure web infrastructure on GCP \u0026amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting\u003c/p\u003e\n\u003cp\u003eYou offer :\u003c/p\u003e\n\u003cp\u003e3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack\u003c/p\u003e\n\u003cp\u003eExtra points if you have:\u003c/p\u003e\n\u003cp\u003eExperience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations\u003c/p\u003e\n\u003cp\u003eLocation :\u003c/p\u003e\n\u003cp\u003eRemote (Already based in Europe or willing to work in EU timezone)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here : \u003ca href=\"https://grnh.se/e0769a2c1\"\u003ehttps://grnh.se/e0769a2c1\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"},{"id":"b99f4c2c-e94b-11e8-8abf-17c73d6427e2","type":"Contract","url":"https://jobs.github.com/positions/b99f4c2c-e94b-11e8-8abf-17c73d6427e2","created_at":"Fri Nov 16 03:01:16 UTC 2018","company":"Ikayzo","company_url":"http://ikayzo.com","location":"Vancouver (remote)","title":"Senior Software Engineer - Ruby on Rails / React ","description":"\u003cp\u003e\u003cstrong\u003eRemote position for Vancouver, BC residents\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://ikayzo.com\"\u003eIkayzo\u003c/a\u003e, a boutique software development firm based in Honolulu, is looking for experienced Ruby on Rails developers with strong React skills capable of taking complex projects from ideation to release. In this role he / she will be responsible for building high quality, secure and scalable web applications in the finance / fintech space. Our customers include industry leading software firms, renewable energy companies and financial institutions.\u003c/p\u003e\n\u003cp\u003ePlease provide your GitHub profile or another work example reference in your resume.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA solid grounding in OO software architecture / design patterns\u003c/li\u003e\n\u003cli\u003eA pragmatic approach focused on delivering on-time while maintaining quality\u003c/li\u003e\n\u003cli\u003eExperience designing and implementing successful non-trivial enterprise Ruby on Rails projects (5+ years)\u003c/li\u003e\n\u003cli\u003eExperience with ReactJS (Reflux or Redux)\u003c/li\u003e\n\u003cli\u003eExperience with agile development methodologies\u003c/li\u003e\n\u003cli\u003eComfort with Git Feature Branch Workflow and the ability to incorporate PR feedback quickly\u003c/li\u003e\n\u003cli\u003eFirm grasp of data modeling\u003c/li\u003e\n\u003cli\u003eA passion for software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eNote: Specialized finance domain knowledge is not required but successful applicants must be able to quickly understand complex business rules and calculations.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWe are not accepting applications from recruiters for this position.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend resumes to \u003ca href=\"mailto:career@ikayzo.com\"\u003ecareer@ikayzo.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe74b61172b5e2551482923d6459b31814afbde1/a4dc87ba-891e-4dc3-a3e8-30201cbdbacc"},{"id":"47328346-e90c-11e8-9429-c09930ae6ec9","type":"Full Time","url":"https://jobs.github.com/positions/47328346-e90c-11e8-9429-c09930ae6ec9","created_at":"Thu Nov 15 19:26:24 UTC 2018","company":"Acadian Asset Management","company_url":"http://acadian-asset.com","location":"Boston, MA","title":"Full Stack Developer \u0026 Senior Analyst (Investment Analytics)","description":"\u003cp\u003ePosition Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms\u003c/li\u003e\n\u003cli\u003eEngineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools\u003c/li\u003e\n\u003cli\u003eTeam up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building browser-based applications using JavaScript, CSS, and HTML\u003c/li\u003e\n\u003cli\u003eExperience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent knowledge and technical work experience\u003c/li\u003e\n\u003cli\u003eHands on experience running http server such as Apache / NGINX\u003c/li\u003e\n\u003cli\u003ePrior investment/financial industry knowledge is not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther technologies we use:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSQL, NoSQL, MongoDB, Redis\u003c/li\u003e\n\u003cli\u003eNumpy, Scipy, Pandas\u003c/li\u003e\n\u003cli\u003eD3, AngularJS, Node\u003c/li\u003e\n\u003cli\u003eDocker, Slurm, ZeroMQ, AWS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--703f54fc6dc8eda27790b08f4867a4593f252f09/e875225d-b3cc-454b-9e2f-a7e80cdb65fa"},{"id":"76fcadae-e84e-11e8-88fc-96a168773892","type":"Full Time","url":"https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892","created_at":"Wed Nov 14 20:50:03 UTC 2018","company":"NBCUniversal","company_url":"https://www.nbcunicareers.com/","location":"Universal City, CA","title":"Media Software Engineer","description":"\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"cb1e9170-e832-11e8-8c0b-1d1828cf3aff","type":"Full Time","url":"https://jobs.github.com/positions/cb1e9170-e832-11e8-8c0b-1d1828cf3aff","created_at":"Wed Nov 14 17:30:09 UTC 2018","company":"Cobot","company_url":"http://cobot.me","location":"Berlin, Germany","title":"Backend Developer Ruby/Elixir","description":"\u003cp\u003eYou are looking to put your skills to use in a fast-moving product used by thousands of people every day? \u003cstrong\u003eYou care about maintainable, tested, well-documented code, consistency and technical excellence, while always putting the user’s needs first?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a developer focused on backend who is excited to work within an \u003cstrong\u003einternational and welcoming team\u003c/strong\u003e of backend developers, frontend developers, and support engineers to build and maintain a fast and robust codebase for Cobot.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCobot is a management platform for coworking spaces. Our app helps coworking spaces around the world to automate their operations so that they can focus on what matters most: building communities and welcoming workspaces.\u003c/strong\u003e Coworking spaces from New Delhi to San Francisco use us to manage their members, collect payments, book conference rooms, and more. Our customers range from small creative spaces with only a few members to huge business accelerators with thousands of people. We’re a bootstrapped company, operating since 2006 out of Berlin Kreuzberg. We’re a team of 15 people, meaning lots of opportunity for you to actively shape the product, and contribute to the success of the team in a very direct way.\u003c/p\u003e\n\u003cp\u003eOur technology stack is evolving all the time. Our backend is 90% Ruby/Rails, and we recently started to use Elixir. Our frontend is server generated HTML or Ember.JS. As databases, we use CouchDB, Postgres, DynamoDB. We deploy to AWS and Heroku.\u003c/p\u003e\n\u003cp\u003eOur team values working at a healthy pace and a normal working day over working long hours late into the night. We foster a culture of continuous improvement and learning. Making mistakes is part of what we do, and we make sure we have each other’s backs and learn from them.\u003c/p\u003e\n\u003cp\u003eWe value diversity in all aspects of our team. We value everyone’s questions, insights and feedback.\u003c/p\u003e\n\u003cp\u003eThis is a permanent, employed full-time position in Berlin.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eRead on\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3RXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--596ac329ee8f03d221fe26add5a4ef67dd172bfa/b1d4b584-1e58-476c-85bd-4997962d599e"},{"id":"dc5e367e-e74d-11e8-83b6-bff5f2b12e4f","type":"Full Time","url":"https://jobs.github.com/positions/dc5e367e-e74d-11e8-83b6-bff5f2b12e4f","created_at":"Tue Nov 13 14:11:38 UTC 2018","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"DevOps Engineer","description":"\u003cp\u003eYou are a DevOps or System Engineer who can’t wait to be part of a growing team and to make actual impact. At VONQ we do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!\u003c/p\u003e\n\u003cp\u003eDevOps Engineer\nRotterdam, fulltime, ASAP\u003c/p\u003e\n\u003cp\u003eBe part of our journey and bring our development process, infrastructure and engineering practices to the next level\nAs our System Engineer you will be the one leading critical platform development efforts. What you’ll actually be contributing to? Our core product, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.\u003c/p\u003e\n\u003cp\u003eWe have an ambitious roadmap for the upcoming period. Your part in the process? We will start to utilise a number of various DevOps practices - and that’s where you come in!\u003c/p\u003e\n\u003cp\u003eYou will be part of an international and experienced Engineering department consisting of Backend and Frontend Developers, Data Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003cp\u003eYour day-to-day job in a nutshell as VONQ’s DevOps Engineer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMake fully functional environments available on demand for the development team\nProvide guidance and support on application architecture as we move to a container based architecture\u003c/li\u003e\n\u003cli\u003eEnsure a smooth flow of work for all of our development teams\u003c/li\u003e\n\u003cli\u003eEnable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure\u003c/li\u003e\n\u003cli\u003eYou'll work autonomously to make our architectural and business goals a reality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGreat understanding of DevOps practices and an Agile mindset, that is you!\nThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years relevant experience\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eExperience working in application development, systems or IT operations\u003c/li\u003e\n\u003cli\u003eExperience with Cloud and container technologies (e.g. AWS, docker, rocket)\u003c/li\u003e\n\u003cli\u003eGreat understanding DevOps practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)\u003c/li\u003e\n\u003cli\u003eYou can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)\u003c/li\u003e\n\u003cli\u003eExperience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo\u003c/li\u003e\n\u003cli\u003eExperience in contributing to the systems architecture of a company\u003c/li\u003e\n\u003cli\u003eLast but not least, you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with application development (e.g. PHP, Scala, Ruby, Golang)\u003c/li\u003e\n\u003cli\u003eExperience with data engineering (e.g. spark, scala, databricks)\u003c/li\u003e\n\u003cli\u003eWorked as part of a distributed (or international) team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is why you should join our team\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.\nOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!\u003c/p\u003e\n\u003cp\u003eWe have legendary company outing, beers on Friday and lots of FUN!\u003c/p\u003e\n\u003cp\u003eThere is more! We offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003eTime and budget for training\u003c/li\u003e\n\u003cli\u003eRelocation support, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the challenge? Join VONQ as System Engineer and make things happen! Please apply by using this application link\n. Questions? Contact Sarah (Recruiter) -\u0026gt; sarahellithy(at)vonq.com.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply by using this application link\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42ef9e87e92144f85a34863593358a683954179e/d08b7e6a-0293-4795-9808-a6b527efd7da"},{"id":"dc428b94-e42e-11e8-91e2-23879ca9e8b0","type":"Full Time","url":"https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0","created_at":"Fri Nov 09 14:51:11 UTC 2018","company":"New York University","company_url":null,"location":"New York, New York 10001","title":"Technology Solutions Developer","description":"\u003cp\u003eAs a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.\u003c/p\u003e\n\u003cp\u003eUS\u003c/p\u003e\n\u003cp\u003eThe Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.\u003c/p\u003e\n\u003cp\u003eOur group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.\u003c/p\u003e\n\u003cp\u003eYOU\u003c/p\u003e\n\u003cp\u003eWe're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!\u003c/p\u003e\n\u003cp\u003eWHY\u003c/p\u003e\n\u003cp\u003eAs an employee of NYU Law, you would receive NYU's benefits (\u003ca href=\"https://www.nyu.edu/employees/benefit.html\"\u003ehttps://www.nyu.edu/employees/benefit.html\u003c/a\u003e), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.\u003c/p\u003e\n\u003cp\u003eRequired Education:\nBachelor's degree.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003ePreferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.\u003c/p\u003e\n\u003cp\u003eRequired Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.\u003c/p\u003e\n\u003cp\u003ePreferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)\u003c/p\u003e\n\u003cp\u003eEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105491972\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"f61bcf90-e400-11e8-8ff5-71d2e066e687","type":"Full Time","url":"https://jobs.github.com/positions/f61bcf90-e400-11e8-8ff5-71d2e066e687","created_at":"Fri Nov 09 09:23:05 UTC 2018","company":"University of Cambridge","company_url":"https://www.gen.cam.ac.uk/","location":"Cambridge, UK","title":"Research Software Engineer","description":"\u003cp\u003e\u003cstrong\u003eResearch Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you passionate about open source and making user friendly client-side web applications? We’re a small team comprised of five developers (six, if you join us!) and a biologist, looking for a developer to help us create client-side applications for the open source \u003ca href=\"http://www.intermine.org\"\u003eInterMine\u003c/a\u003e data warehouse platform. Using JavaScript and ClojureScript, the successful applicant will create tools to query and display complex biological data.\u003c/p\u003e\n\u003cp\u003eWe have a lot of fun problems to solve, using the best technologies. How do you let naive users search complex biological data sets? How do you visualise data to let people absorb complicated relationships quickly? How can we use technology to get scientists the answers and data they need? We’re deeply committed to open source and the open science movement. We’re passionate about standards and making scientific data available to everyone.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInterMine​ is an open source Java-based data warehouse, integrating biological data in varied formats into a PostgreSQL database. InterMine also includes ​ web services with client libraries​ in R, Python, Perl, Ruby, Java, and JavaScript, and a legacy JSP-based UI. We’ve also developed ​ BlueGenes​ -- our new user interface powered by Clojure. See our current projects on ​\u003ca href=\"https://github.com/intermine/\"\u003eGitHub​\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for an enthusiastic problem solver willing to learn and try new technologies. You’ll be able to show us beautiful interfaces you’ve made. You’ll be comfortable with HTML, CSS, Javascript, and working with the DOM. Note that previous experience with Clojure and / or biology is not required. However an interest and willingness to learn is!\u003c/p\u003e\n\u003cp\u003ePlease see the \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ejob advert\u003c/a\u003e for specific details.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Offer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a member of a small team, you’ll have the chance to learn and extend your skills significantly. Opportunities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einteracting with a ​ worldwide community of open-source contributors​ .\u003c/li\u003e\n\u003cli\u003ementoring students through programs such as ​ Google Summer of Code​ .\u003c/li\u003e\n\u003cli\u003euser testing your applications, both in person and via video conferencing.\u003c/li\u003e\n\u003cli\u003epresenting/co-authoring academic papers, posters, and talks at technical and\nacademic conferences.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe offer very competitive salaries and a generous benefits package (see\n\u003ca href=\"http://www.jobs.cam.ac.uk/offer%E2%80%8B\"\u003ehttp://www.jobs.cam.ac.uk/offer​\u003c/a\u003e for the full list).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e33 days annual holiday\u003c/li\u003e\n\u003cli\u003e37.5 hour work week\u003c/li\u003e\n\u003cli\u003eUniversity pension\u003c/li\u003e\n\u003cli\u003eChild care and bike to work salary sacrifice schemes\u003c/li\u003e\n\u003cli\u003eAccess to ​ University sports facilities\u003c/li\u003e\n\u003cli\u003eFamily friendly benefits​ like maternity, paternity and parental leave, flexible\nworking and career break schemes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"b82067ca-e322-11e8-814a-239ee3094eb4","type":"Full Time","url":"https://jobs.github.com/positions/b82067ca-e322-11e8-814a-239ee3094eb4","created_at":"Thu Nov 08 15:13:52 UTC 2018","company":"Gatekeeper","company_url":"https://www.gatekeeperhq.com/","location":"Remote","title":"Senior Ruby Developer - Remote","description":"\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\nWe’re looking for a senior backend ruby developer to join our growing experienced and talented technology team. The development team is responsible for all the vital backend infrastructure for our web application, \u003ca href=\"https://www.gatekeeperhq.com/\"\u003eGatekeeper\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe develop in Ruby on Rails, so having demonstrable senior experiences of this is essential. You should be capable of working on all aspects of the software development cycle from architecture, coding and testing through to deployment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevelopment team\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe're a distributed team of experienced developers\u003c/li\u003e\n\u003cli\u003eWe love Ruby\u003c/li\u003e\n\u003cli\u003eWe know how to cook a Rails monolith in the right way\u003c/li\u003e\n\u003cli\u003eWe do care about the project, about the code quality and about our customers\u003c/li\u003e\n\u003cli\u003eWe use code reviews (reviewing each other)\u003c/li\u003e\n\u003cli\u003eWe have Code to Test Ratio: 1:1.1\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIREMENTS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRequired skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLoves Ruby\u003c/li\u003e\n\u003cli\u003eStrong Rails knowledge, a good understanding of reliable design for big Rails projects\u003c/li\u003e\n\u003cli\u003eConfident with SQL (PostgreSQL in particular)\u003c/li\u003e\n\u003cli\u003eClean code with an understanding of code smells and refactoring\u003c/li\u003e\n\u003cli\u003eTest-driven development - “Test Obsessed”\u003c/li\u003e\n\u003cli\u003eUnderstanding of front-end development (HTML/HAML/SASS/JS). However, no knowledge of frameworks required.\u003c/li\u003e\n\u003cli\u003eExperience of delivering large development projects\u003c/li\u003e\n\u003cli\u003eTangible contribution to the open-source community or trackable record of public talks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe need a talent who wants to be a long-term part of our business — not just an employee!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSalary dependent on experience (range $4,000 - $6,500)\u003c/li\u003e\n\u003cli\u003eWork from home\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003e4 weeks paid leave\u003c/li\u003e\n\u003cli\u003eWe’ll pay for you to take any relevant training that improves your value to Gatekeeper\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e$2000 REFERRAL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDo you know someone that would be eligible for this role? We are offering a $2000 referral reward if you introduce a suitable candidate that we decide to hire\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend CODE EXAMPLES and your CV to Mihaela Radu at \u003ca href=\"mailto:mihaela.r@gatekeeperhq.com\"\u003emihaela.r@gatekeeperhq.com\u003c/a\u003e or apply directly here: \u003ca href=\"https://gatekeeper.workable.com/jobs/810060\"\u003ehttps://gatekeeper.workable.com/jobs/810060\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3hXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98bb3f53733a14cadb93db6b3512f37a3774eeb8/9f0637f8-8115-4a84-9f10-44a5c84d10bd"},{"id":"36bb2228-e201-11e8-9310-b526bfa5a16e","type":"Full Time","url":"https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e","created_at":"Tue Nov 06 20:19:44 UTC 2018","company":"Cortex Building Intelligence","company_url":"https://cortexintel.com/","location":"New York, NY","title":"Software Engineer, Full Stack (Rails, React)","description":"\u003cp\u003e\u003cstrong\u003eCompany Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.\u003c/li\u003e\n\u003cli\u003eIntegrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.\u003c/li\u003e\n\u003cli\u003eWorking closely with our Customer Success team to support client onboarding and operations.\u003c/li\u003e\n\u003cli\u003eTaking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.\u003c/li\u003e\n\u003cli\u003eStrong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.\u003c/li\u003e\n\u003cli\u003eExperience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.\u003c/li\u003e\n\u003cli\u003eProduct-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills.  Committed, hard-working, and thoughtful.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.\u003c/li\u003e\n\u003cli\u003eUnlimited paid time off.\u003c/li\u003e\n\u003cli\u003eYour choice of 13” or 15” Macbook Pro.\u003c/li\u003e\n\u003cli\u003eWork in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSchedule a time to chat with our CTO, Justin Spradlin: \u003ca href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\"\u003ehttps://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"},{"id":"9636b280-e12a-11e8-819f-7c947fed1ee2","type":"Full Time","url":"https://jobs.github.com/positions/9636b280-e12a-11e8-819f-7c947fed1ee2","created_at":"Mon Nov 05 20:22:43 UTC 2018","company":"Homestars","company_url":"http://homestars.com","location":"Toronto","title":"Salesforce Engineer ","description":"\u003cp\u003eWHO WE ARE:\nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs by allowing them to search our database of companies and hundreds of thousands of reviews. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars has recently been acquired by ANGI Homeservices Inc., the #1 marketplace in the US for helping homeowners connect with the best home service providers.\u003c/p\u003e\n\u003cp\u003eWHY JOIN US:\nHomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be work or be a part of organization with an exceptional environment, we want to hear from you!\u003c/p\u003e\n\u003cp\u003ePerks of working at HomeStars:\n-We are growing fast. HomeStars is part of the ANGI Homeservices Inc. family.\u003c/p\u003e\n\u003cp\u003e-Excellent Benefits Package. We want a healthy and productive team.\u003c/p\u003e\n\u003cp\u003e-Company wide social events and team building activities.\u003c/p\u003e\n\u003cp\u003e-December Break. The office is closed the week before New Year’s.\u003c/p\u003e\n\u003cp\u003e-Personal Growth. We seek to provide employees with constructive feedback to foster their career growth.\u003c/p\u003e\n\u003cp\u003e-Beautiful brick \u0026amp; beam office in the heart of the entertainment district in Toronto.\u003c/p\u003e\n\u003cp\u003e-Rec room with lounge, ping pong, darts and foosball.\u003c/p\u003e\n\u003cp\u003eABOUT THE ROLE:\nWe are looking for a Salesforce.com Developer who will drive the implementation of Salesforce and its utilization across our organization. The Salesforce Engineer will manage the technical aspects of Salesforce CRM application.\u003c/p\u003e\n\u003cp\u003eTHE OPPORTUNITY:\n-Work in a fast-paced, agile project environment with small, focused teams.\u003c/p\u003e\n\u003cp\u003e-An opportunity to work on a range of platforms such as: Salesforce, Web Applications, Android, iOS.\u003c/p\u003e\n\u003cp\u003e-Gain hands on experience with the latest technologies.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork closely with both the Salesforce and Engineering team at HomeStars.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eResponsible for the technical aspects of Salesforce.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e-Develop custom solutions in VisualForce, Apex, Java, AJAX, and other key technologies.\u003c/p\u003e\n\u003cp\u003e-Develop and maintain Visualforce, Apex, and Integration tools to other third party solutions.\u003c/p\u003e\n\u003cp\u003e-Working closely with the other departments in order to respond to user’s questions and issues.\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS:\n-2-3 years of experience with software development (Java and/or C# preferred).\u003c/p\u003e\n\u003cp\u003e-Ability to organize and prioritize responsibilities effectively in order to meet deadlines\u003c/p\u003e\n\u003cp\u003e-Understanding of multiple programming environments and tools.\u003c/p\u003e\n\u003cp\u003e-Experience with Cloud or Saas solutions.\u003c/p\u003e\n\u003cp\u003e-Knowledge of data management, SQL, SOA design principles.\u003c/p\u003e\n\u003cp\u003e-Understanding of Ruby on Rails, NodeJS, JavaScript,HTML, CSS, and JSON, and exposure to REST based web services.\u003c/p\u003e\n\u003cp\u003e-Understanding of the Salesforce platform (Admin/Config, Apex, VisualForce, Triggers, etc.).\u003c/p\u003e\n\u003cp\u003e-Salesforce experience as a developer or end user.\u003c/p\u003e\n\u003cp\u003eBENEFITS:\nWe are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail resume directly to:\n\u003ca href=\"mailto:jessica.chester@homestars.com\"\u003ejessica.chester@homestars.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cda082695a7f08b5567363aa9531c30e29fe648/3de2fb1b-53e9-414f-b371-b04b36617c7d"},{"id":"cdd3b306-ded1-11e8-9d57-a9ea0396f64e","type":"Full Time","url":"https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e","created_at":"Fri Nov 02 19:02:51 UTC 2018","company":"Jun Group","company_url":"https://www.jungroup.com/","location":"New York, NY","title":"Senior Software Developer, Server-Side Technologies","description":"\u003cp\u003eThe word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.\u003c/p\u003e\n\u003cp\u003eWe are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.\u003c/p\u003e\n\u003cp\u003eWho you are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks\u003c/li\u003e\n\u003cli\u003eYou want to be part of a small team inside a large company with massive opportunity for growth\u003c/li\u003e\n\u003cli\u003eYou enjoy collaboration with other teams including product, biz dev, and our in-house QA team\u003c/li\u003e\n\u003cli\u003eYou eagerly dig into complex engineering problems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite scalable back-end and front-end code in JRuby, Java, and JavaScript\u003c/li\u003e\n\u003cli\u003eExperiment with new tech to find the right tool for the job\u003c/li\u003e\n\u003cli\u003eMaintain high code quality through code reviews and automated tests\u003c/li\u003e\n\u003cli\u003eUse Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow we do it\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby/Rails\u003c/li\u003e\n\u003cli\u003eJavaScript (JQuery, AngularJS, Vue.js)\u003c/li\u003e\n\u003cli\u003eIntelliJ IDEA / TeamCity\u003c/li\u003e\n\u003cli\u003eAWS (EC2, EB, RDS)\u003c/li\u003e\n\u003cli\u003eGoogle Cloud (BiqQuery, Dataflow, Cloud Functions)\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we offer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA highly competitive compensation package\u003c/li\u003e\n\u003cli\u003e401k with company match\u003c/li\u003e\n\u003cli\u003ePaid vacation, work from home, and sick days\u003c/li\u003e\n\u003cli\u003eAnnual personal development budget to attend a conference of your choice\u003c/li\u003e\n\u003cli\u003eDesignated time to work on the company-related projects you feel strongly about\u003c/li\u003e\n\u003cli\u003eMacbook Pros, dual monitors, and a quiet working space\u003c/li\u003e\n\u003cli\u003eCatered lunch at least once a week\u003c/li\u003e\n\u003cli\u003eMonthly company events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.\u003c/p\u003e\n\u003cp\u003eTotal compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/06736d9f2\"\u003ehttps://grnh.se/06736d9f2\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"},{"id":"48d5274e-dd45-11e8-8130-eacb3354d656","type":"Full Time","url":"https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656","created_at":"Wed Oct 31 19:45:06 UTC 2018","company":"Traction","company_url":"https://www.tractionco.com/","location":"Sunnyvale, CA ","title":"Lead Full Stack Developer","description":"\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"690c9fd8-dc37-11e8-9487-4c8007ecf678","type":"Full Time","url":"https://jobs.github.com/positions/690c9fd8-dc37-11e8-9487-4c8007ecf678","created_at":"Tue Oct 30 11:32:08 UTC 2018","company":"Clark Germany GmbH","company_url":null,"location":"Frankfurt","title":"Senior Software Engineer (m/f)","description":"\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003eAs our Senior Software Engineer, you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eplay a central role in the design and development of our backend system and architecture\u003c/li\u003e\n\u003cli\u003eactively contribute to product management and influence our features right from the start\u003c/li\u003e\n\u003cli\u003elift the intelligence of our robo advisor and the efficiency of our insurance operations team\u003c/li\u003e\n\u003cli\u003eclosely interact with colleagues who use your software to service our customers\u003c/li\u003e\n\u003cli\u003econceptualise and deliver features on a platform that will soon serve \u0026gt; 500000 customers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave gained a Technical University or Bachelor's degree\u003c/li\u003e\n\u003cli\u003ehave minimum 4 years experience in software engineering and web development, incl. 2 years Ruby on Rails, as well as other languages\u003c/li\u003e\n\u003cli\u003ea deep understanding of modern software architecture and software design principles, e.g. SOLID, Event Processing, and Domain Driving Design, git, scrum and agile approaches\u003c/li\u003e\n\u003cli\u003etest-driven development and quality assurance through automated testing are selfevident\u003c/li\u003e\n\u003cli\u003egood knowledge of cloud infrastructure and continuous deployment\u003c/li\u003e\n\u003cli\u003eexperience with Javascript Frontend Frameworks especially with Ember are a plus\u003c/li\u003e\n\u003cli\u003eexcellent skills in handling SQL and relational database\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebesides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply:\n\u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4040394002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4040394002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers, Hanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n","company_logo":null},{"id":"f3ba7836-dc36-11e8-9e85-eda172fcc718","type":"Full Time","url":"https://jobs.github.com/positions/f3ba7836-dc36-11e8-9e85-eda172fcc718","created_at":"Tue Oct 30 11:28:52 UTC 2018","company":"Clark Germany GmbH","company_url":null,"location":"Frankfurt","title":"Senior Frontend Developer (m/f)","description":"\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003eAs our Senior Frontend Developer, you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eblend concepts of web, mobile, and chat into an awesome user experience\u003c/li\u003e\n\u003cli\u003ework with rockstar designers who deliver you pixel perfect sketch files to get beyond what is imaginable\u003c/li\u003e\n\u003cli\u003einfluence the choice and design of upcoming features by getting involved in product management\u003c/li\u003e\n\u003cli\u003eapply latest frontend technologies to deliver working software\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave gained a Technical University or Bachelor's degree\u003c/li\u003e\n\u003cli\u003ehave minimum 2 years experience in developing Web Applications using modern Frameworks (e.g. Angular, Ember)\u003c/li\u003e\n\u003cli\u003eare strong in applying CSS \u0026amp; SASS, as well as responsive design\u003c/li\u003e\n\u003cli\u003eNice to have: you previously develoeped hybrid mobile apps and have knowledge of android or iOS design guidelines\u003c/li\u003e\n\u003cli\u003eBig plus: having worked with ruby on rails\u003c/li\u003e\n\u003cli\u003ehave a sense for good user experience\u003c/li\u003e\n\u003cli\u003esee transitions and animations as a natural of Web Design\u003c/li\u003e\n\u003cli\u003eare experienced in using content management systems\u003c/li\u003e\n\u003cli\u003ehave a thorough understanding of software design patterns and how to structure larger web applications in Javascript\u003c/li\u003e\n\u003cli\u003eare applying automated UI Testing\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebeside the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply: \u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4039724002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4039724002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers, Hanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8dcf30dfdbc23ae5192d8953560982236d9fb769/0e3929e7-f54a-4fcc-a72b-7fbc6cbf8f25"},{"id":"3cfd9704-dc36-11e8-90bf-c8a16734ec04","type":"Full Time","url":"https://jobs.github.com/positions/3cfd9704-dc36-11e8-90bf-c8a16734ec04","created_at":"Tue Oct 30 11:23:55 UTC 2018","company":"Clark Germany GmbH","company_url":null,"location":"Frankfurt","title":"Senior Architect (m/f)","description":"\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003eAs our Senior Architect (m/f), you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ework with engineering managers, product managers, technical leads and other engineers to design, develop and deliver our intelligent consumer insurance platform.\u003c/li\u003e\n\u003cli\u003estay hands on in coding \u0026amp; software development practices by actively contributing to features.\u003c/li\u003e\n\u003cli\u003eensures the logical and systematic conversion of business, customer and product requirements into flexible technical solutions which support current and future needs.\u003c/li\u003e\n\u003cli\u003ecollaborate with cross-functional teams to analyze and decompose complex software systems.\u003c/li\u003e\n\u003cli\u003emaintain up to date documentation of our current architecture and plan our architecture roadmap.\u003c/li\u003e\n\u003cli\u003eplan the migration and subsequent decommissioning of partner systems onto the Clark platform.\u003c/li\u003e\n\u003cli\u003ebring together different perspectives and opinions to come to a common approach.\n \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave minimum 5 years experience in the development of transactional, mission critical applications in heterogeneous environments.\u003c/li\u003e\n\u003cli\u003epragmatic application of UML, BPMN and initial experience of TOGAF or related architecture frameworks.\u003c/li\u003e\n\u003cli\u003eknowledge in Domain Driven Design and Event Driven Architecture is highly desired.\ncloud architecture experience (SaaS, PaaS, IaaS, etc.) incl. containerisation, kubernetes, AWS.\u003c/li\u003e\n\u003cli\u003ein-depth knowledge of design \u0026amp; enterprise integration patterns.\u003c/li\u003e\n\u003cli\u003eindustry expertise in financial services.\u003c/li\u003e\n\u003cli\u003eexperience in product line engineering and software customisation.\u003c/li\u003e\n\u003cli\u003eknowledge of \u0026gt; 3 programming languages, incl. Ruby\n \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebesides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\ncompetitive Salary\nlearning budget for your personal development\nshares in our Company\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nexplore new collaboration models with renowned partners\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses inhouse.\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply: \u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4090598002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4090598002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers,\nHanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a8a1e456930770d1ec835659cde46b101f4f18bb/0f654b81-0727-4933-9417-e76fac3fbb5d"},{"id":"5cfc5c04-d90f-11e8-9d50-d2e1d303c48e","type":"Full Time","url":"https://jobs.github.com/positions/5cfc5c04-d90f-11e8-9d50-d2e1d303c48e","created_at":"Fri Oct 26 11:08:15 UTC 2018","company":"http://www.paddle.com","company_url":"http://www.paddle.com","location":"London","title":"Senior Python Software Engineer ","description":"\u003cp\u003eYou'll be a part of a friendly and expanding team of talented engineers, working on the newest parts of the \u003cem\u003ePaddle\u003c/em\u003e ecosystem and helping our Software Sellers sell their products on a platform they trust and rely on.\u003c/p\u003e\n\u003cp\u003eOur Engineering department is split into five teams, focusing on different parts of the buyer and seller experience. Teams are fairly static to give every member the chance to become a high performer,, but there's always a chance to try something new. With the engineering team expanding so quickly, values and culture are very important to us, and you'll be expected to help keep the great environment we have currently as we grow.\u003c/p\u003e\n\u003cp\u003eYou are empowered to use the right language for the job for our services, which at the moment for us means using Golang or Python hosted in Lambda, PHP in ECS using docker, and static React sites statically hosted in S3. We will give you the freedom to make technology and tooling decisions and educate the rest of your colleagues accordingly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you'll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on high traffic APIs used by hundreds of active vendors\u003c/li\u003e\n\u003cli\u003eCreate brand new products used by \u003cem\u003ePaddle\u003c/em\u003e\n\u003c/li\u003e\n\u003cli\u003eContribute to designing how \u003cem\u003ePaddle\u003c/em\u003e uses and develops it’s microservices\u003c/li\u003e\n\u003cli\u003eWork collaboratively to design API specifications\u003c/li\u003e\n\u003cli\u003ePractise DevOps, you’re responsible for getting your code to production and supporting it\u003c/li\u003e\n\u003cli\u003eUse the latest cloud services available to run your code\u003c/li\u003e\n\u003cli\u003eWrite performant and well-tested code\u003c/li\u003e\n\u003cli\u003eHelp design a stable platform to support phenomenal growth\u003c/li\u003e\n\u003cli\u003eParticipate in the recruitment process: CV reviews, interviews, reviewing technical ability and cultural fit\u003c/li\u003e\n\u003cli\u003eBe a resource for less senior Engineers to provide mentoring and coaching\u003c/li\u003e\n\u003cli\u003ePlay a part in an agile team - participate in stand-ups, sprint planning \u0026amp; retrospectives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe'd love to hear from you if\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have competent commercial experience developing applications or other software platforms\u003c/li\u003e\n\u003cli\u003eYou have a strong understanding of the development process from design through to deployment and maintenance and what that means for day-to-day development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour technical skill set includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicroservice architecture, design, and standard methodologies with an eye towards scale.\u003c/li\u003e\n\u003cli\u003eBuilding RESTful APis/ web applications using Python\u003c/li\u003e\n\u003cli\u003eUnit and behavioural testing\u003c/li\u003e\n\u003cli\u003eSQL\u003c/li\u003e\n\u003cli\u003eVersion control systems (preferably Git)\u003c/li\u003e\n\u003cli\u003eExposure to another language, e.g. PHP, Golang, JavaScript, Ruby\u003c/li\u003e\n\u003cli\u003eExposure to cloud providers (preferably AWS)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThings you'll learn on the job\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS suite - SQS, EC2, ECS+ECR, CloudFormation, S3, RDS, Cloudwatch\u003c/li\u003e\n\u003cli\u003eDocker containers and micro-service architecture\u003c/li\u003e\n\u003cli\u003eMonitoring and alerting at scale\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy you’ll love working at Paddle\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a diverse team of just over 100 people (quickly on our way to 180+) based near London Bridge (but moving to Shoreditch by EOY). We care deeply about enabling a great culture which is inclusive no matter your background. We celebrate our diverse group of talented employees and we pride ourselves on our transparent, collaborative, friendly and respectful culture.\u003c/p\u003e\n\u003cp\u003eWe offer a full slate of benefits, including competitive salaries, stock options, pension plans, private healthcare and on-site coaching sessions. We believe in flexible working and offer all team members unlimited holidays and 3 months paid parental leaves regardless of gender. Plus we offer some not-so-standard, extra-fun benefits, which can include anything from joining office football team, taking up in-office yoga lessons or enjoying a board game night. We host regular company get-togethers and quarterly socials. We have weekly catered lunches and of course, fully stocked fridges and cold brew on tap. We value learning and will help you with your personal development where we can — from constant exposure to new challenges and annual learning stipend to regular internal and external training.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission is to help software companies succeed — enabling them to focus on creating products the world loves. Hundreds of companies rely on our e-commerce platform to sell their software products globally, as well as our powerful analytics and marketing tools to understand and grow their businesses.\u003c/p\u003e\n\u003cp\u003eOur vision is to become the platform that all software companies use to run and grow their business. We aim to replace a fragmented ecosystem of specialised tools with a unified platform that removes the complex burden that comes with running a software business, whilst also providing unparalleled insight to help them grow faster.\u003c/p\u003e\n\u003cp\u003eWe’re early in our journey but making great progress: Deloitte Fast 50 named us the fastest growing software company in the UK (we’ve tripled revenue every year since our launch in 2012), and we’ve raised over $17m in funding from incredible investors such as Notion, BGF and Kindred.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe in having diverse teams in which everyone can be their authentic self is key to our success. We encourage people from underrepresented backgrounds to apply and we don't discriminate based on race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, marital status, disability or age. Our office is wheelchair friendly and we are a family-friendly employer​.\u003c/p\u003e\n\u003cp\u003eCome join us, and find out what the best work of your career could look like for you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our website: \u003ca href=\"https://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002\"\u003ehttps://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b0abd7e6d191b98e36fdf022128b3755200da29a/e0c799c9-8deb-4a76-aaf4-e13cf221ca35"},{"id":"ec37b682-d902-11e8-9f44-b572cb1c6642","type":"Full Time","url":"https://jobs.github.com/positions/ec37b682-d902-11e8-9f44-b572cb1c6642","created_at":"Fri Oct 26 09:40:08 UTC 2018","company":"ProntoPro","company_url":"http://www.prontopro.it","location":"Milan, Italy","title":"Frontend Software Engineer ","description":"\u003cp\u003eNOI\u003c/p\u003e\n\u003cp\u003eProntoPro.it è il portale dei professionisti N. 1 in Italia. Aiutiamo milioni di clienti a trovare il professionista di cui hanno bisogno: dal fotografo per il matrimonio, all’idraulico, all’insegnante di chitarra. Stiamo portando meritocrazia e trasparenza in un mercato finora opaco; vogliamo trasformare sia il modo in cui gli italiani scelgono un professionista sia quello in cui i professionisti trovano clienti.\u003c/p\u003e\n\u003cp\u003eSiamo una startup in grandissima crescita: a marzo 2015 eravamo 2 persone, oggi siamo più di 100. 29 anni è l'età media, lavoriamo in open space, e riduciamo al minimo la burocrazia (perchè è semplicemente controproducente), ognuno ha grandi responsabilità e impatta direttamente sul nostro successo.\u003c/p\u003e\n\u003cp\u003eAbbiamo investitori istituzionali del calibro di Immobiliare.it, e angel investor di alto profilo, che lavorano in Google, Facebook, eBay, McKinsey e Unicredit: non abbiamo più i rischi tipici di una startup. Nel 2017 abbiamo avviato il processo di internazionalizzazione conquistando anche il mercato di Austria e Svizzera, e non é finita qua...\u003c/p\u003e\n\u003cp\u003eCerchiamo persone che vogliano costruire un colosso nel mondo del digital italiano che impatti fortemente la vita di tutti noi. Non è un lavoro tranquillo – ci mettiamo il cuore.\u003c/p\u003e\n\u003cp\u003eIL TUO RUOLO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProntoPro cambierà il modo in cui i clienti trovano i professionisti. Avrai piena visibilità sul business, non solo sulla tua area. Ci si aspetta quindi che tu apporti valore anche a livello architetturale, a livello di prodotto e a livello strategico, senza limitarti ad eseguire ciò che è esplicitamente richiesto.\u003c/li\u003e\n\u003cli\u003eSarai parte del team Technology, oggi composto da 15 (+) persone e che arriverà a 25 entro fine 2018.\u003c/li\u003e\n\u003cli\u003eCreerai un prodotto scalabile che sosterrà la fase di hyper-growth dell'azienda.\u003c/li\u003e\n\u003cli\u003eLavorerai in un ambiente particolarmente attento ai trend tecnologici emergenti e alle metodologie di lavoro agile. In ProntoPro utilizziamo PHP, Symfony, Node.js, SASS, ReactJS, MySQL, AuroraDB, Redis, MongoDB, RabbitMQ, Solr, New Relic, Kubernetes, Docker, Ansible, Git, Drone.io. L’iniziativa personale nell’arricchire/modificare lo stack è un tema a cui siamo molto sensibili, pertanto ci aspettiamo il tuo contributo.\u003c/li\u003e\n\u003cli\u003eParteciperai ad eventi di settore ed avrai la possibilità di raccontare come in ProntoPro abbiamo affrontato e vinto sfide tecnologiche.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTU\u003c/p\u003e\n\u003cp\u003eStiamo cercando un Software Engineer che voglia unirsi al nostro team Technology.\u003c/p\u003e\n\u003cp\u003eCi aspettiamo che tu abbia una solida esperienza in:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJavascript, CSS, SASS, SCSS, manipolazione DOM e JS object model\u003c/li\u003e\n\u003cli\u003eScrivere codice pulito, mantenibile, scalabile e aderente ai principi SOLID\u003c/li\u003e\n\u003cli\u003eAssicurare test coverage del codice prodotto\u003c/li\u003e\n\u003cli\u003eAstrarre il codice prodotto costruendo componenti e librerie riutilizzabili\u003c/li\u003e\n\u003cli\u003eOttimizzare i componenti creati per ottenere massime performances sull'intera gamma di device/browser supportati\u003c/li\u003e\n\u003cli\u003eUtilizzare (e quando necessario creare da zero) client e librerie per consumare servizi REST\u003c/li\u003e\n\u003cli\u003eUtilizzare strumenti di sviluppo e build (Babel, Webpack, NPM, …)\u003c/li\u003e\n\u003cli\u003eRevisionare le pull requests dei tuoi colleghi\u003c/li\u003e\n\u003cli\u003eLavorare in pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReactJS, Redux e isomorphic React\u003c/li\u003e\n\u003cli\u003eWebSocket\u003c/li\u003e\n\u003cli\u003eLibrerie di data structuring (es. immutable.js)\u003c/li\u003e\n\u003cli\u003ePattern di autenticazione (OAuth2, JWT, …)\u003c/li\u003e\n\u003cli\u003eCreare e gestire applicazioni ed ambienti basati su Docker\u003c/li\u003e\n\u003cli\u003ePipeline di continuous integration/delivery in ambienti come Jenkins e Drone.io\u003c/li\u003e\n\u003cli\u003eConoscenza di altri linguaggi di programmazione (PHP, Python, Ruby, …)\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSimply send us an email with your CV to \u003ca href=\"mailto:peopleops@prontopro.it\"\u003epeopleops@prontopro.it\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOR apply easily on our website:\n\u003ca href=\"https://prontopro.recruiterbox.com/jobs/fk0hzbs/\"\u003ehttps://prontopro.recruiterbox.com/jobs/fk0hzbs/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dcb2d0e46779aae0236b5ce387f65d7a47a55e73/3d97c575-b7f8-4490-a39a-36785dbe6744"},{"id":"0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0","type":"Full Time","url":"https://jobs.github.com/positions/0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0","created_at":"Wed Oct 24 19:14:53 UTC 2018","company":"Stride Consulting","company_url":"https://www.stridenyc.com/","location":"New York, New York","title":"Software Engineer","description":"\u003cp\u003eStride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’ll be in great company.\u003c/p\u003e\n\u003cp\u003eOur goal is to leave our client teams functioning at a higher level than when we found them.  We do this by writing high quality code alongside our clients’ development teams, as well as mentoring their developers, product teams and stakeholders in software development best practices.\u003c/p\u003e\n\u003cp\u003eWe believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs a Strider, you’ll find a learning opportunity that’s unmatched. You will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe part of an engineering-driven culture, one that has a 4.9 star Glassdoor review and has won Crain’s -Best Places to Work 2 years in a row.\u003c/li\u003e\n\u003cli\u003eWrite high quality code with some of the smartest engineers in town.\u003c/li\u003e\n\u003cli\u003eImmerse yourself in a learning journey that’s second to none. No where else will you find the variety that being a consultant brings, all a subway ride away.\u003c/li\u003e\n\u003cli\u003eMentor and be mentored. Learning weaves a thread through all that we do.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA Day In The Life of a Stride Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll co-locate and work onsite at your client (all are in NYC). We are proud to call the most outstanding tech teams in NYC our clients, ranging from funded startups to Fortune 500.\u003c/p\u003e\n\u003cp\u003eYou are empowered to define what work/life balance means to you. Every day for every Strider is different. Here’s how one day might unfold:\u003c/p\u003e\n\u003cp\u003e9am: One-on-one with my manager. We grab coffee at Stumptown and talk about my career goals. I’m noodling on a complex React story and I get my manager’s take. We walk away with action items for next week’s one-on-one.\u003c/p\u003e\n\u003cp\u003e10am: Daily Standup. I’m at work at the client’s office. They’ve got a really cool setup with dual monitors and nice pairing stations. I’m on a team of 4 Striders and 4 client developers. Our Product Manager kicks off the Standup. It lasts about 10 minutes and then we’re off to code.\u003c/p\u003e\n\u003cp\u003e10:10-12:00 Pair Programming. I’m pairing with another Strider. We continue working on the React story from the day before. We have questions for the Product Manager that we ask via Slack.\u003c/p\u003e\n\u003cp\u003e12:00-12:30 Travel to Stride\u003c/p\u003e\n\u003cp\u003e12:30-1:30 Lunch-n-Learn. Today, Stride’s got a Lunch-n-Learn on Terraform Cloud that I’m psyched about. Stacey, one of our senior engineers, is leading the session. We hold Lunch-n-Learns every few weeks and I go to about half of them.\u003c/p\u003e\n\u003cp\u003e1:30-1:45 Travel back to the client’s office.\u003c/p\u003e\n\u003cp\u003e1:45-2:45 Retrospective. Retrospectives on my team are amazing. Today we’re retrospecting our last release. I’ve never facilitated a retrospective before, but my goal is to facilitate one this June. We have a nice rhythm and walk away with action items and confidence in the path ahead.\u003c/p\u003e\n\u003cp\u003e2:45-6 Pair Programming. I get in a few more hours of coding. This afternoon, my pair is Amy, a junior dev who works for the client. I love mentoring and am really excited to have this time to mentor Amy. I’ve been coding about 3 years myself, so at first the idea of mentoring someone else gave me imposter syndrome, but the Stride approach is fluid and allows for flexibility and it’s been a huge career learning experience for me.\u003c/p\u003e\n\u003cp\u003e6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be doing\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWriting high quality code, and bringing a ‘teach a team to fish’ mentality to your project.\u003c/li\u003e\n\u003cli\u003eEmbed with development teams in some of NYC’s most exciting companies to help them up their game and get stuff done.\u003c/li\u003e\n\u003cli\u003eAdvocate for non-dogmatic Agile software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement.\u003c/li\u003e\n\u003cli\u003eBe part of a cross functional team that includes Striders (likely 2-6 Strider engineers plus a product manager) and client employees (likely engineers and other tech roles).\u003c/li\u003e\n\u003cli\u003eWork with a variety of tech stacks, and a see a variety of tech teams. We embed with teams who write code in modern tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou’re a fit for Stride if you have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of software development experience\u003c/li\u003e\n\u003cli\u003eExperience in multiple programming languages\u003c/li\u003e\n\u003cli\u003eExcitement to learn new languages and frameworks\u003c/li\u003e\n\u003cli\u003eExperience with TDD, story estimation, test writing, and pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect from us:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous learning on things that you are passionate about\u003c/li\u003e\n\u003cli\u003eCompetitive Pay and Benefits (including Profit Sharing!)\u003c/li\u003e\n\u003cli\u003eEmpowerment to work at a self-defined Sustainable Pace\u003c/li\u003e\n\u003cli\u003eNo travel, all of our clients are located in NYC\u003c/li\u003e\n\u003cli\u003e$2,000 and up to two weeks of your time for self-directed professional development\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eFollow this link and submit your application!\n\u003ca href=\"https://grnh.se/48e351b21\"\u003ehttps://grnh.se/48e351b21\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1519dc6ab4f7ab9dd26e999a6547bd915811998/c960e5e4-ab0b-4f84-ab8e-2554b72a8f66"},{"id":"7c44cf7c-d713-11e8-89be-b3e23046d61a","type":"Full Time","url":"https://jobs.github.com/positions/7c44cf7c-d713-11e8-89be-b3e23046d61a","created_at":"Tue Oct 23 22:32:57 UTC 2018","company":"Susco Solutions","company_url":"http://www.suscosolutions.com","location":"New Orleans, LA","title":"Senior .NET Developer","description":"\u003cp\u003eSusco helps businesses grow by creating software customized to their unique needs.  We believe that our work helps people live more fulfilling lives by reducing their repetitive tasks, allowing them to concentrate on more valuable work.\u003c/p\u003e\n\u003cp\u003eSusco is located in the Greater New Orleans Area and is one of the fastest-growing tech companies in Louisiana.  We develop custom web-based business software with a focus on legacy system conversions.  Our primary development platforms are C# .NET for web services, and Ionic/Cordova for mobile apps.\u003c/p\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5 Years web development experience\u003c/li\u003e\n\u003cli\u003eElicitation of requirements from non-technical business users\u003c/li\u003e\n\u003cli\u003eConceptually design systems based on business requirements\u003c/li\u003e\n\u003cli\u003ePerform technical lead role through the SDLC\u003c/li\u003e\n\u003cli\u003eHighly proficient in database design and SQL\u003c/li\u003e\n\u003cli\u003eHighly proficient in a server-side language such as C#, Java, Ruby, Python, or PHP\u003c/li\u003e\n\u003cli\u003eHighly proficient with Javascript\u003c/li\u003e\n\u003cli\u003eExperience with CSS/HTML\u003c/li\u003e\n\u003cli\u003eAbility to adapt to rapidly changing environments\u003c/li\u003e\n\u003cli\u003eSelf-motivated with a positive attitude\u003c/li\u003e\n\u003cli\u003eWillingness to drive projects to completion in a fast-moving environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNice-to-Have\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Kendo UI\u003c/li\u003e\n\u003cli\u003eExperience with Legacy system conversions\u003c/li\u003e\n\u003cli\u003eBS/BA degree\u003c/li\u003e\n\u003cli\u003eAzure experience\u003c/li\u003e\n\u003cli\u003eLinux experience\u003c/li\u003e\n\u003cli\u003eMobile development experience\u003c/li\u003e\n\u003cli\u003eC# Expertise\u003c/li\u003e\n\u003cli\u003eMicrosoft Visual Studio\u003c/li\u003e\n\u003cli\u003eSalesforce Experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApplication Development, primarily ASP.NET (C#.NET)\u003c/li\u003e\n\u003cli\u003eDatabase Design and Maintenance\u003c/li\u003e\n\u003cli\u003eRequirements analysis\u003c/li\u003e\n\u003cli\u003eAssisting with the development of scope documents and budgets for new work\u003c/li\u003e\n\u003cli\u003ePerform work within allotted hourly budgets and within specific timeframes\u003c/li\u003e\n\u003cli\u003eClient communication\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSalary: $80,000 - $100,000/year\u003c/li\u003e\n\u003cli\u003e3 Weeks PTO + 9 Holidays\u003c/li\u003e\n\u003cli\u003e3 Days/year of self-driven learning time like conferences\u003c/li\u003e\n\u003cli\u003eHealth, Dental, Life, Disability Insurance\u003c/li\u003e\n\u003cli\u003eVarious Wellness activities paid for\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur Core Values\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGrowth\u003c/strong\u003e: We believe we can create a better world by constantly growing as individuals, resulting in growth for the Company and growth for our clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAction\u003c/strong\u003e: We believe we don't have good days, we make them.  We believe in being proactive and not reactive. Passivity leads to a lack of involvement, while our focus is on creating the future.  We don't complain, we identify and solve problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTeamwork\u003c/strong\u003e: We believe that we are human beings first, coworkers second.  We strive to be cognizant as people with lives outside of this office.  As a high-performance organization, there are times of high stress.  In those times, we rally to get the job done and we recognize our behavior and performance impacts our team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEfficiency\u003c/strong\u003e: We believe in learning from our mistakes the first time.  We believe there is a time and place for complex solutions for complex problems.  We also have the ability to decompose complex problems into simpler problems. When we see a problem or inefficiency, we have both the responsibility and ability to propose solutions.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\"\u003ehttp://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a583748c64683a61f69820356121822fc877418e/0fa7beb8-d72e-4f11-8509-5394c2375b87"}]